[{"name":"Borscht","cooktime":70,"photoURL":"https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F44%2F2019%2F08%2F26232722%2F3747653.jpg&q=85","instructions":"Stew beets, beef chunks, onions, carrots, and whatever else you'd like in a pot for 70 minutes.","_locals":{}},{"name":"Chicken Salad","cooktime":30,"photoURL":"https://healthyfitnessmeals.com/wp-content/uploads/2021/04/Southwest-chicken-salad-7.jpg","instructions":"Chop up cooked chicken and whatever salad bits you'd like, and toss them in a bowl.","_locals":{}},{"name":"Waffles","cooktime":25,"photoURL":"https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2020%2F03%2F34761.jpg","instructions":"Press pancake or waffle batter in a waffle iron until done, then top with whatever you please.","_locals":{}},{"name":"Osso Buco","cooktime":180,"photoURL":"https://www.simplyrecipes.com/thmb/YOvR_V7EJTilPOUnlG9nk9fiJC4=/2000x1334/filters:fill(auto,1)/__opt__aboutcom__coeus__resources__content_migration__simply_recipes__uploads__2006__12__Osso-Buco-LEAD-5-a816159cbe9740a5b21f3c1e515f9da2.jpg","instructions":"Braise veal with vegetables, white wine, and broth.","_locals":{}},{"name":"Fried Rice","cooktime":20,"photoURL":"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/delish-fried-rice-009-1543877224.jpg?crop=1xw:1xh;center,top&resize=768:*","instructions":"3 tbsp. sesame oil, divided 3 large eggs Kosher salt2 carrots, diced 3 green onions, thinly sliced, white and green parts divided3 cloves garlic, minced1 tbsp. peeled and minced ginger (from a 1' piece) 4 c. cooked long grain rice (preferably leftover) 3/4 c. frozen peas 3 tbsp. low-sodium soy sauce Crack the eggs into a small bowl and beat them together.Heat a skillet with 1 tablespoon of the oil over medium-high heat. Once the pan is hot, add the beaten eggs and scramble them for about a minute. Transfer the eggs to a dish and turn off the heat.Drizzle the remaining 2 tablespoons of oil into a wok over high heat. Add the onions and cook them for about 1 to 2 minutes, stirring constantly. Add the mixed vegetables and white parts of the scallions and cook for 2 minutes. Season the vegetables with a pinch of salt.Add the cooked rice into the pan or wok and cook for several minutes, until the rice is heated through. If there are large clumps of rice, break them apart with the back of your spatula.Add the soy sauce, five-spice powder, dash of white pepper (if using) and sesame oil and stir to distribute the seasonings. (See note 6) Add the scrambled eggs and stir to mix again. Garnish with remaining sliced scallions. Serve immediately.","_locals":{}},{"name":"Perfect Pumpkin Pie","cooktime":"110","photoURL":"https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2021%2F10%2F25%2F23439-perfect-pumpkin-pie-tealover.jpg","instructions":"Preheat oven to 425 degrees F. Whisk pumpkin, sweetened condensed milk, eggs, spices and salt in medium bowl until smooth. Pour into crust. Bake 15 minutes.\nReduce oven temperature to 350 degrees F and continue baking 35 to 40 minutes or until knife inserted 1 inch from crust comes out clean. Cool. Garnish as desired. Store leftovers covered in refrigerator."},{"name":"Yorkshire Pudding","cooktime":"95","photoURL":"https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4373133.jpg","instructions":" Mix flour and salt together until blended. Make a well in the flour, add the milk, and whisk until consistent. Beat the eggs into the batter. Add water and beat again until the mixture is light and frothy. Set aside for an hour (or, if it's the day before, cover in the fridge overnight).\nIf the batter has been refrigerated, allow it to come up to room temperature before using. When the roast beef is ready to come out of the oven, ready the mixture.\nPreheat oven to 400 degrees F (205 degrees C).\nPour off drippings from roast beef and measure out desired amount (about 1/2 cup should do). Pour drippings into a 9x12 inch baking dish and place into the oven until the drippings sizzle. Pour the batter over the drippings and bake for 30 minutes (or until the sides have risen and are golden brown). Cut into eight portions and serve immediately.","_locals":{}},{"name":"Baba Ganoush","cooktime":"55","photoURL":"https://cookieandkate.com/images/2017/10/baba-ganoush-recipe-2.jpg","instructions":" Roast eggplants in the oven, then use them in the same way as you would chickpeas in a hummus."}]